# GetPoint Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
PointNode..::..GetPoint Method
PointNode Class See Also
---
Returns the point object corresponding to the node.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public Point GetPoint()
```

Visual Basic
---
```text
Public Function GetPoint As Point
```

Visual C++
---
```text
public:
Point^ GetPoint()
```

# ### Return Value
The point instance.
# See Also
PointNode Class
Autodesk.Revit.DB Namespace